const {User} = require('../models/relation');

const names = {
  'Гриневич Олена': '',
  'Орманжи Вікторія': '',
  'Молчанова Оксана': '',
  'Форостян Любава': '',
  'Білик Марія-Катерина': '',
  'Стельник Оксана': '',
  'Дегтяр Альона': '',
  'Пижик Віолета': '',
  'Малишева Олександра': '',
  'Тараненко Олена': '',
  'Завальна Юлія': '',
  'Гвоздецька Лариса': '',
  'Корольова Віра': '',
  "Третяк Мар'яна": '',
  'Гєєнко Наталія': '',
  'Зацаринна Марина': '',
  'Гусарська Наталія': '',
  'Ляшенко Поліна': '',
  'Дмитриєвський Олексій': '',
  'Новосільська Марія': '',
  'Гулак Антоніна': '',
  'Левченко Марія': '',
  'Фесак Вікторія': '',
  'Ващик Лілія': '',
  'Гладун Анастасія': '',
  'Сліпович Наталія': '',
  'Струкова Марина': '',
  'Нагорна Ірина': '',
  'Рожко Олена': '',
  'Серафімов Ілля': '',
  'Іваненко Дмитро': '',
  'Хижняк Марія': '',
  'Пономарчук Анастасія': '',
  'Савчин Анастасія': '',
  'Билень Оксана': '',
  'Тараненко Анастасія': '',
  'Мушин Тетяна': '',
  'Домажирська Неля': '',
  'Безматірних Надія': '',
  'Василега Поліна': '',
  'Непрядкіна Ірина': '',
  'Ротай Віра': '',
  'Ружина Марія': '',
  'Бойко Наталія': '',
  'Любич-Роман Оксана': '',
  'Малага Анжеліка': '',
  'Павліщева Анна': '',
  'Огієнко Данило': '',
  'Михайлевська Наталія': '',
  'Криворученко Наталія': '',
  'Чорна Вікторія': '',
  'Нікуліна Наталія': '',
  'Лубенець Гюльнара': '',
  'Ніколаєва Вікторія': '',
  'Авдашкова Альона': '',
  'Хаврук Дарина': '',
  'Атаманюк Мар’яна': '',
  'Остропільська Вікторія': '',
  'Сивик Ігор': '',
  'Верзун Уляна': ''
};

const findEmails = async () => {
  for (const [key, value] of Object.entries(names)) {
    const emails = await User.findAll({where: {name: key}, attributes: ['email']});
    names[key] = emails[0]?.email;
  }
  console.log(Object.values(names));
};

module.exports = findEmails;
