const {User} = require('../models/relation');

const names = {
  'Колеснік Дмитро': '',
  'Швед Назарій': '',
  'Калін Максим': '',
  'Калинчук Іван': '',
  'Титаренко Маргарита': '',
  'Перловська Анна': '',
  'Шкумбатюк Богдана': '',
  'Стасюк Роман': '',
  'Палій Андрій': '',
  'Титаренко Милослава': '',
  'Пивовар Альона': '',
  'Карташов Микита': '',
  'Рубінський Ілля': '',
  'Дебольський Олександр': '',
  'Гаврилюк Артур': '',
  'Карпій Віталій': '',
  'Посацький Роман': '',
  'Кулеш Іван': '',
  'Мякота Ярослав': '',
  'Панчишин Данило': '',
  'Бєлашов Іван': '',
  'Данчишин Андрій': '',
  'Кішечко Станіслав': '',
  'Кришталь Олександр': '',
  'Николенко Андрій': '',
  'Григоряк Назар': '',
  'Шевцова Вероніка': '',
  'Кислун Андрій': '',
  'Кеван Олександр': '',
  'Мандзя Андрій': '',
  'Романюк Лілія': '',
  'Волинець Андрій': '',
  'Козаков Данило': '',
  'Ухов Остап': '',
  'Безноскович Дмитро': '',
  "Сербенюк В'ячеслав": '',
  'Печонкін Максим': '',
  'Лященко Віталій': '',
  'Левандовський Владислав': '',
  'Яноші Михайло': '',
  'Марфіч Сергій': '',
  'Шляхтицький Дмитро': '',
  'Даниленко Артем': ''
};

const findEmails = async () => {
  for (const [key, value] of Object.entries(names)) {
    const emails = await User.findAll({where: {name: key}, attributes: ['email']});
    names[key] = emails[0]?.email;
  }
  console.log(Object.values(names));
};

module.exports = findEmails;
